Edragon/WCH/CH55x/Official Examples/eg20-CH554串口接收数据转USB键值上传/USB/Device/Key.C
/*******************************************************************************
* Function Name  : QueryUART1Interrupt(void)
* Description    : UART1中断服务程序
*******************************************************************************/
void  QueryUART1Interrupt( void ) interrupt INT_NO_UART1 using 2             //UART1中断服务程序,使用寄存器组1
{
    if(U1RI)
    {
        U1RI = 0;
        DataBuffer[RecvPoint++] = SBUF1;
        DataLen++;
        if(RecvPoint==BUFMAX) RecvPoint=0;			
    }
    U1TI = 0;
}

/*******************************************************************************
* Function Name  : KeyCodeCorrespond()
* Description    : 键码比对表，由数值对应键盘值。
* Input          : UINT8 keyCode 
* Output         : None
* Return         : None
*******************************************************************************/
void KeyCodeCorrespond(UINT8 keyCode)
{
	HIDKey[0] = 0; 
	if((keyCode>='a')&&(keyCode<='z')){                                       //键值a-z
 
		if(LED_VALID&0x02)
		{
			FLAG = 0;
			HIDKey[2] = 0x39;
			Enp1IntIn();
			while(FLAG == 0);
			FLAG = 0;	
			memset(&HIDKey[0],0,8);
			Enp1IntIn();		
			while(FLAG == 0);				
		}
		keyCode -= 0x5D; 
		HIDKey[2] = keyCode; 		
		
	}
  else if((keyCode>='A')&&(keyCode<='Z')){			
		if((LED_VALID&0x02) == 0)
		{
			FLAG = 0;
			HIDKey[2] = 0x39;
			Enp1IntIn();
			while(FLAG == 0);
			FLAG = 0;	
			memset(&HIDKey[0],0,8);
			Enp1IntIn();		
			while(FLAG == 0);				
		}    
	  
	  
	  keyCode -= 0x3D; 
    HIDKey[2] = keyCode;  
//    HIDKey[0]	= 0x02;	                                                  //shift+		
   
  }
  else if((keyCode>='1')&&(keyCode<='9')){
		keyCode -= 0x13;                                                        //字母区数字键
		HIDKey[2] = keyCode; 		
	}
	else if(keyCode=='0'){
		HIDKey[2] = 0x27; 		
	}		
	else if(keyCode <= 0x2f){		
		if(keyCode == 0x20){
			HIDKey[2] = 0x2C;                                                     //空格        
		}		
		else if(keyCode == 0x21){//'!'
			HIDKey[2] = 0x1E; 
			HIDKey[0]	= 0x02;	                                                  //shift+		
		}
		else if(keyCode == 0x22){//'"'
			HIDKey[2] = 0x34; 
			HIDKey[0]	= 0x02;	                                                  //shift+		
		}
		else if(keyCode == 0x23){//'#'
			HIDKey[2] = 0x20; 
			HIDKey[0]	= 0x02;	                                                  //shift+		
		}
		else if(keyCode == 0x24){//'$'
			HIDKey[2] = 0x21; 
			HIDKey[0]	= 0x02;	                                                  //shift+		
		}	
		else if(keyCode == 0x25){//'%'
			HIDKey[2] = 0x22; 
			HIDKey[0]	= 0x02;	                                                  //shift+		
		}
		else if(keyCode == 0x26){//'&'
			HIDKey[2] = 0x24; 
			HIDKey[0]	= 0x02;	                                                  //shift+		
		}
		else if(keyCode == 0x27){//'%'
			HIDKey[2] = 0x34; 	
		}
		else if(keyCode == 0x28){/*(*/
			HIDKey[2] = 0x26; 
			HIDKey[0]	= 0x02;	                                                  //shift+		
		}
		else if(keyCode == 0x29){/*)*/
			HIDKey[2] = 0x27; 
			HIDKey[0]	= 0x02;	                                                  //shift+		
		}
		else if(keyCode == 0x2a){/***/
			HIDKey[2] = 0x25; 
			HIDKey[0]	= 0x02;	                                                  //shift+		
		}
		else if(keyCode == 0x2b){/*+*/
			HIDKey[2] = 0x2e; 
			HIDKey[0]	= 0x02;	                                                  //shift+		
		}	
		else if(keyCode == 0x2c){/*,*/
			HIDKey[2] = 0x36; 	
		}	
		else if(keyCode == 0x2d){/*-*/
			HIDKey[2] = 0x2d; 	
		}	
		else if(keyCode == 0x2e){/*,*/
			HIDKey[2] = 0x37; 	
		}	
		else if(keyCode == 0x2f){/*/*/
			HIDKey[2] = 0x38; 		
		}		
  }
  else if(keyCode <= 0x3f){	
		if(keyCode == 0x3a){/*:*/
			HIDKey[2] = 0x33; 	
			HIDKey[0]	|= 0x02;	                                                  //shift+			
		}
		else if(keyCode == 0x3b){/*;*/
			HIDKey[2] = 0x33; 			
		}	
		else if(keyCode == 0x3c){/*<*/
			HIDKey[2] = 0x36; 	
			HIDKey[0]	|= 0x02;	                                                  //shift+			
		}
		else if(keyCode == 0x3d){/*=*/
			HIDKey[2] = 0x2e; 				
		}	
		else if(keyCode == 0x3e){/*>*/
			HIDKey[2] = 0x37; 	
			HIDKey[0]	|= 0x02;	                                                  //shift+			
		}
		else if(keyCode == 0x3f){/*?*/
			HIDKey[2] = 0x38; 	
			HIDKey[0]	|= 0x02;	                                                  //shift+			
		}
  }
  else if(keyCode == 0x40){/*@*/
    HIDKey[2] = 0x1f; 	
    HIDKey[0]	= 0x02;	                                                  //shift+			  
  }
  else if((keyCode >= 0x5b)&&(keyCode <= 0x60)){	
		if(keyCode == 0x5b){/*[*/
			HIDKey[2] = 0x2f; 			
		}	
		else if(keyCode == 0x5c){/*\*/
			HIDKey[2] = 0x31; 			
		}
		else if(keyCode == 0x5d){/*:*/
			HIDKey[2] = 0x30; 		
		}	
		else if(keyCode == 0x5e){/*:*/
			HIDKey[2] = 0x23; 	
			HIDKey[0]	= 0x02;	                                                  //shift+			
		}
		else if(keyCode == 0x5f){/*:*/
			HIDKey[2] = 0x2d; 	
			HIDKey[0]	= 0x02;	                                                  //shift+			
		}
		else if(keyCode == 0x60){/*`*/
			HIDKey[2] = 0x35; 			
		}	
	}
  else if((keyCode >= 0x7b)&&(keyCode <= 0x7f)){
		if(keyCode == 0x7b){/*{*/
			HIDKey[2] = 0x2f; 	
			HIDKey[0]	= 0x02;	                                                  //shift+			
		}
		else if(keyCode == 0x7c){/*|*/
			HIDKey[2] = 0x31; 	
			HIDKey[0]	= 0x02;	                                                  //shift+			
		}
		else if(keyCode == 0x7d){/*}*/
			HIDKey[2] = 0x30; 	
			HIDKey[0]	= 0x02;	                                                  //shift+			
		}
		else if(keyCode == 0x7e){/*~*/
			HIDKey[2] = 0x35; 	
			HIDKey[0]	= 0x02;	                                                  //shift+			
		}
		else if(keyCode == 0x7f){/*{*/
			HIDKey[2] = 0x4c; 			
		}
	}
  else if((keyCode >= 0x80)&&(keyCode <= 0x87)){/*left ctl*/	
    keyCode &= 0x0f; 
    HIDKey[0]	= (1<<keyCode);	                                          //			
  }
  else if((keyCode >= 0xd7)&&(keyCode <= 0xda)){/**/
    keyCode -= 0x88; 		
    HIDKey[2]	= keyCode;	                                         	
  }
  else if((keyCode >= 0xb0)&&(keyCode <= 0xb3)){/**/
    keyCode -= 0x88; 		
    HIDKey[2]	= keyCode;	
  }
  else if((keyCode >= 0xd1)&&(keyCode <= 0xd5)){/**/
    keyCode -= 0x88; 		
    HIDKey[2]	= keyCode;	                                         	
  }
  else if((keyCode >= 0xC1)&&(keyCode <= 0xCD)){/**/
    keyCode -= 0x88; 		
    HIDKey[2]	= keyCode;	                                         	
  }

}


void HIDValueHandle()
{
	DataLen--;	

	KeyCodeCorrespond(DataBuffer[SendPoint]);
	
	SendPoint++;
	if(SendPoint>=BUFMAX) SendPoint=0;

	FLAG = 0;
	Enp1IntIn();
	while(FLAG == 0);
	FLAG = 0;	
	memset(&HIDKey[0],0,8);
	Enp1IntIn();		
	while(FLAG == 0);		
	
}

main()
{
    CfgFsys( );                                                           //CH559时钟选择配置
    mDelaymS(5);                                                          //修改主频等待内部晶振稳定,必加	
    mInitSTDIO( );                                                        //串口0初始化	
    printf("start\n");
	USBDeviceInit();                                                      //USB设备模式初始化
    UART1Setup();
    EA = 1;                                                               //允许单片机中断
    IP_EX = bIP_UART1;//串口优先等级高
    UEP1_T_LEN = 0;                                                       //预使用发送长度一定要清空
    FLAG = 0;
    Ready = 0;
	LED_VALID = 1;   //给一个默认值
    while(1)
    {
        if(Ready&&(DataLen>0))
        {
            HIDValueHandle();
        }
    }
}
